package 상속기초;

public class 상속이론 {

	
	// jAVA의 상속
	// >> 기존 클래스의 변수(데이터)와 메소드(로직,코드)를 물려받아
	//	  새로운 클래스를 구성하는 것.
	//	  자식 클래스, 서브 클래스 -- 재사용 + 추가기능 --> 부모 클래스, 슈퍼 클래스
	
	// 상속의 장점
	// 1. 기존 클래스의 변수와 코드를 재사용 -> 코드의 중복 감소, 클래스 간결화
	// 2. 먼저 작성된 검증된 프로그램을 재사용 -> 신뢰성 있는 프로그램 손쉽게 개발
	// 3. 클래스간 계층적 분류 및 관리 -> 유지보수 용이
	
	// 클래스 간 상속 방법
	// class 서브클래스 extends 슈퍼클래스
	//                  ㄴ>(연장하다, 확장하다)
	
	// 상속의 특징
	// 1. 다중상속을 지원하지 않는다.
	// 2. 상속의 횟수에 제한을 두지 않는다.
	// 3. 모든 클래스는 java.lang.Object를 상속받는다.
	
}